(docs) Update more detail about project
- The overview architecture
- The combat system and collision
- The inventory system
- The item system
